{
    "locales": {
        "en": {
            "title": "<span class='text-primary'>Project</span> Experience",
            "description": "The experiences I share below represent my most relevant and recent accomplishments."
        },
        "es": {
            "title": "<span class='text-primary'>Experiencia</span> Profesional",
            "description": "Un vistazo a mi experiencia laboral y trayectoria profesional."
        },
        "fr": {
            "title": "Expérience de <span class='text-primary'>Projet</span>",
            "description": "Les expériences que je partage ci-dessous sont mes réalisations les plus pertinentes et les plus récentes."
        },
        "zh": {
            "title": "<span class='text-primary'>专业</span> 经验",
            "description": "了解我的工作经验和职业之旅。"
        }
    },
    "items": [
        {
            "id": "experience_item_2",
            "place": "@link{places.arduino}",
            "period": [
                "2019/05",
                "2019/07"
            ],
            "locales": {
                "en": {
                    "title": "Connected PM 2.5 remote sensor",
                    "description": "Using an Arduino microcontroller coupled with a Laser Optical Dust Sensor to periodically log PM2.5 measurements into a Google Spreadsheet."
                },
                "es": {
                    "title": "Designer Senior UI/UX",
                    "description": "Lideré proyectos de diseño, realicé investigaciones exhaustivas sobre usuarios y utilicé información basada en datos para mejorar las experiencias de usuario. Gestioné equipos de diseño, fomentando la creatividad y la innovación al tiempo que implementaba las mejores prácticas de diseño para obtener resultados exitosos en diversos productos digitales."
                },
                "fr": {
                    "title": "Capteur distant PM 2.5 connecté",
                    "description": "Utilisation d'un microcontrôleur Arduino associé à un capteur de poussière optique laser pour enregistrer périodiquement les mesures de PM2,5 dans une feuille de calcul Google."
                },
                "zh": {
                    "title": "高级UI/UX设计师",
                    "description": "领导设计项目，进行全面的用户研究，利用数据驱动的见解提升用户体验。管理设计团队，培养创意和创新，同时实施设计最佳实践，为各种数字产品交付成功的结果。"
                }
            }
        },
        {
            "id": "experience_item_3",
            "place": "@link{places.googleCloud}",
            "period": [
                "2020/08",
                "2020/10"
            ],
            "locales": {
                "en": {
                    "title": "News Sentinel",
                    "description": "A Google Cloud Function scraping data from a webpage multiple times a day and sending an alert using a Telegram bot if certain conditions are met."
                },
                "es": {
                    "title": "Designer UX Principal",
                    "description": "Impulsé iniciativas de UX supervisando un equipo de diseñadores, elaborando estrategias de diseño y liderando colaboraciones multifuncionales con gerentes de producto, ingenieros y ejecutivos. Centrado en crear diseños centrados en el usuario que se alinearan con los objetivos comerciales y que dieron como resultado una mayor satisfacción del usuario."
                },
                "fr": {
                    "title": "Sentinelle d'Actualités",
                    "description": "Une Google Cloud Function extrait des données d'une page web plusieurs fois par jour et envoie une alerte en utilisant un bot Telegram si certaines conditions sont remplies."
                },
                "zh": {
                    "title": "首席用户体验设计师",
                    "description": "通过监督设计团队、制定设计战略，并与产品经理、工程师和高管共同推动跨职能合作，推动了用户体验的创新。专注于创建符合业务目标的以用户为中心的设计，从而实现了增强的用户满意度。"
                }
            }
        },
        {
            "id": "experience_item_4",
            "place": "@link{places.nlp}",
            "period": [
                "2020/08",
                "2020/11"
            ],
            "locales": {
                "en": {
                    "title": "SEER Project (Stock Exchange Evolution from Reports)",
                    "description": "Scraping major finance press articles to extract NYSE company names using spaCy, analyzing article sentiment using Finbert, simulating investments in the most popular company that appeared on a given day, and generating a plot to display the results."
                },
                "es": {
                    "title": "Profesor de Tiempo Completo en UX Design",
                    "description": "Utilicé mi experiencia en diseño UX para educar e inspirar a los estudiantes en el arte de los principios de diseño centrado en el usuario. Realicé estudios de usuarios, analicé datos y orienté a los estudiantes en la aplicación de conocimientos teóricos a proyectos prácticos, empoderando a la próxima generación de diseñadores UX."
                },
                "fr": {
                    "title": "SEER Project (Stock Exchange Evolution from Reports)",
                    "description": "Scrapping d'articles des principaux site de finance pour extraire les noms des entreprises de la NYSE à l'aide de spaCy, analyse du sentiment des articles à l'aide de Finbert, simulation d'investissements dans la société la plus populaire apparue un jour donné, et génération d'un graphique pour afficher les résultats."
                },
                "zh": {
                    "title": "全职用户体验设计教授",
                    "description": "利用我的用户体验设计专业知识，教育和激励学生学习以用户为中心的设计原则。进行用户研究，分析数据，并指导学生将理论知识应用于实际项目，培养下一代用户体验设计师。"
                }
            }
        },
        {
            "id": "experience_item_5",
            "place": "@link{places.gis}",
            "period": [
                "2021/08",
                "2021/08"
            ],
            "locales": {
                "en": {
                    "title": "Gaussian Blur QGS Plugin",
                    "description": "Built A QGIS plugin to smooth and generalize a DEM raster for producing cleaner elevation contour lines using the new scipy's fast Fourier transform, fftconvolve."
                },
                "es": {
                    "title": "Profesor de Tiempo Completo en UX Design",
                    "description": "Utilicé mi experiencia en diseño UX para educar e inspirar a los estudiantes en el arte de los principios de diseño centrado en el usuario. Realicé estudios de usuarios, analicé datos y orienté a los estudiantes en la aplicación de conocimientos teóricos a proyectos prácticos, empoderando a la próxima generación de diseñadores UX."
                },
                "fr": {
                    "title": "PLugin QGIS de flou gaussien",
                    "description": "Fabrication d'un plugin QGIS pour lisser et généraliser une image matricielle MNE (Modèle Numérique d'Élévation) afin de produire des lignes de contour d'altitude plus nettes en utilisant la nouvelle Transformation de Fourier rapide (FFT) de scipy, fftconvolve."
                },
                "zh": {
                    "title": "全职用户体验设计教授",
                    "description": "利用我的用户体验设计专业知识，教育和激励学生学习以用户为中心的设计原则。进行用户研究，分析数据，并指导学生将理论知识应用于实际项目，培养下一代用户体验设计师。"
                }
            }
        },
        {
            "id": "experience_item_6",
            "place": "@link{places.cesium}",
            "period": [
                "2021/08",
                "2022/02"
            ],
            "locales": {
                "en": {
                    "title": "Tout En Marchant Journaling",
                    "description": "A web app to display geotagged media assets along an animated path, including elevation data, drawn on the Earth's relief."
                },
                "es": {
                    "title": "Profesor de Tiempo Completo en UX Design",
                    "description": "Utilicé mi experiencia en diseño UX para educar e inspirar a los estudiantes en el arte de los principios de diseño centrado en el usuario. Realicé estudios de usuarios, analicé datos y orienté a los estudiantes en la aplicación de conocimientos teóricos a proyectos prácticos, empoderando a la próxima generación de diseñadores UX."
                },
                "fr": {
                    "title": "Journal de bord Tout En Marchant",
                    "description": "Une application web pour afficher des éléments multimédias géo-étiquetés le long d'un chemin animé, y compris des données d'altitude, tracé sur le relief de la Terre."
                },
                "zh": {
                    "title": "全职用户体验设计教授",
                    "description": "利用我的用户体验设计专业知识，教育和激励学生学习以用户为中心的设计原则。进行用户研究，分析数据，并指导学生将理论知识应用于实际项目，培养下一代用户体验设计师。"
                }
            }
        },
        {
            "id": "experience_item_7",
            "place": "@link{places.pandas}",
            "period": [
                "2022/06",
                "2022/07"
            ],
            "locales": {
                "en": {
                    "title": "Integrity Checker",
                    "description": "Ensure the data integrity of a large collection (greater than 10,000) of media assets by using SHA-1 hashes stored in Pandas dataframes."
                },
                "es": {
                    "title": "Profesor de Tiempo Completo en UX Design",
                    "description": "Utilicé mi experiencia en diseño UX para educar e inspirar a los estudiantes en el arte de los principios de diseño centrado en el usuario. Realicé estudios de usuarios, analicé datos y orienté a los estudiantes en la aplicación de conocimientos teóricos a proyectos prácticos, empoderando a la próxima generación de diseñadores UX."
                },
                "fr": {
                    "title": "Controleur d'intégrité",
                    "description": "Assurer l'intégrité des données d'une grande collection (supérieure à 10 000) d'éléments multimédias en utilisant des hachages SHA-1 stockés dans des dataframes Pandas."
                },
                "zh": {
                    "title": "全职用户体验设计教授",
                    "description": "利用我的用户体验设计专业知识，教育和激励学生学习以用户为中心的设计原则。进行用户研究，分析数据，并指导学生将理论知识应用于实际项目，培养下一代用户体验设计师。"
                }
            }
        },
        {
            "id": "experience_item_8",
            "place": "@link{places.pySpark}",
            "period": [
                "2023/08",
                "2023/09"
            ],
            "locales": {
                "en": {
                    "title": "Stock Exchange Analysis",
                    "description": "Fetch 20 years of intraday historical stock prices from various APIs, store them into a PySpark DataFrame, simulate an investment strategy, and create a plot."
                },
                "es": {
                    "title": "Diseñador de UX",
                    "description": "Contribuí al diseño de interfaces de aplicaciones web intuitivas y amigables para el usuario, creando experiencias de usuario atractivas y fluidas. Colaboré estrechamente con equipos multifuncionales e interesados para asegurarme de que los diseños se alinearan con los objetivos comerciales y las necesidades de los usuarios."
                },
                "fr": {
                    "title": "Analyse de la Bourse",
                    "description": "Récupérez 20 ans de données historiques de cotation intraday à partir de différentes API, stockez-les dans un DataFrame PySpark, simulez une stratégie d'investissement et créez un graphique."
                },
                "zh": {
                    "title": "用户体验设计师",
                    "description": "为设计直观、用户友好的网络应用界面作出了贡献，创建了引人入胜且无缝的用户体验。与跨职能团队和利益相关者密切合作，确保设计与业务目标和用户需求相一致。"
                }
            }
        },
        {
            "id": "experience_item_codeKoriko",
            "place": "@link{places.codeKoriko}",
            "period": [
                "2023/11",
                "Present"
            ],
            "locales": {
                "en": {
                    "title": "Founder & Lead Developer",
                    "description": "Founded codeKoriko, a development company specializing in web and mobile applications. Led a team of developers to deliver high-quality software solutions."
                },
                "es": {
                    "title": "Fundador y Desarrollador Principal",
                    "description": "Fundé codeKoriko, una empresa de desarrollo especializada en aplicaciones web y móviles. Lideré un equipo de desarrolladores para entregar soluciones de software de alta calidad."
                },
                "fr": {
                    "title": "Fondateur et Développeur Principal",
                    "description": "Fondé codeKoriko, une entreprise de développement spécialisée dans les applications web et mobiles. Dirigé une équipe de développeurs pour fournir des solutions logicielles de haute qualité."
                },
                "zh": {
                    "title": "创始人兼首席开发者",
                    "description": "创立了codeKoriko，一家专注于Web和移动应用程序开发的公司。领导开发团队交付高质量的软件解决方案。"
                }
            }
        },
        {
            "id": "experience_item_9",
            "place": "@link{places.leveros}",
            "period": [
                "2023/11",
                "Present"
            ],
            "locales": {
                "en": {
                    "title": "Lead Developer for Leveros Platform",
                    "description": "Spearheading the development of the Leveros platform, a leveraged crypto-assets lending solution. Responsible for front-end development using Vue 3 and Bootstrap 5, back-end architecture, and the creation of secure smart contracts on the Ethereum blockchain. The platform addresses the volatility of cryptocurrency markets by allowing users to borrow crypto-assets with leverage, offering advanced features like multi-token pools and callback mechanisms to reduce gas fees."
                },
                "es": {
                    "title": "Desarrollador Principal de la Plataforma Leveros",
                    "description": "Liderando el desarrollo de la plataforma Leveros, una solución de préstamos de criptoactivos con apalancamiento. Responsable del desarrollo front-end con Vue 3 y Bootstrap 5, la arquitectura back-end y la creación de contratos inteligentes seguros en la blockchain de Ethereum. La plataforma aborda la volatilidad de los mercados de criptomonedas, permitiendo a los usuarios pedir prestados criptoactivos con apalancamiento, ofreciendo características avanzadas como pools de múltiples tokens y mecanismos de callback para reducir las tarifas de gas."
                },
                "fr": {
                    "title": "Développeur Principal pour la Plateforme Leveros",
                    "description": "Dirige le développement de la plateforme Leveros, une solution de prêt de crypto-actifs avec effet de levier. Responsable du développement front-end avec Vue 3 et Bootstrap 5, de l'architecture back-end, et de la création de contrats intelligents sécurisés sur la blockchain Ethereum. La plateforme répond à la volatilité des marchés de cryptomonnaies en permettant aux utilisateurs d'emprunter des crypto-actifs avec levier, en offrant des fonctionnalités avancées comme des pools multi-tokens et des mécanismes de callback pour réduire les frais de gas."
                },
                "zh": {
                    "title": "Leveros平台的首席开发者",
                    "description": "负责领导Leveros平台的开发，这是一个加密资产杠杆借贷解决方案。负责使用Vue 3和Bootstrap 5进行前端开发，搭建后端架构，以及在以太坊区块链上创建安全的智能合约。该平台通过允许用户借入加密资产以应对加密货币市场的波动，提供了多令牌池和回调机制等高级功能，以减少燃气费。"
                }
            }
        }
    ]
}
